tap 'buo/cask-upgrade'
tap 'homebrew/bundle'
# tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'nicoverbruggen/homebrew-cask' # For `phpmon`
tap 'teamookla/speedtest' # For `speedtest`

brew 'pkg-config' # bunch of things need this
brew 'awscli'
brew 'bat'
brew 'c-ares'
brew 'composer'
brew 'coreutils'
brew 'dnsmasq'
brew 'exa'
brew 'fd'
brew 'findutils'
brew 'flyctl'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'git-flow'
brew 'git-open'
brew 'gnu-sed'
brew 'gnu-which'
brew 'gnupg'
brew 'go'
brew 'gti'
brew 'helix'
brew 'java'
brew 'lazygit'
brew 'less'
brew 'mackup'
brew 'mas'
brew 'neovim'
brew 'nginx'
brew 'node'
brew 'php'
brew 'postgresql@15'
brew 'ripgrep'
brew 'speedtest'
brew 'sqlite'
brew 'tree'
brew 'vim'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'z'
brew 'zellij'
brew 'zsh-autosuggestions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'
brew 'zsh'

# apps
cask '1password'
cask '1password-cli'
cask 'arc'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'github'
cask 'grammarly-desktop'
cask 'herd'
cask 'imageoptim'
cask 'iterm2'
cask 'kitty'
cask 'loom'
cask 'messenger'
cask 'notion'
cask 'postman'
cask 'quicklook-json'
cask 'ray'
cask 'raycast'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'tableplus'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'transmission'
cask 'tuple'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'

# mas 'Adblock Plus', id: 1432731683
# mas 'GarageBand', id: 682658836
# mas 'iMovie', id: 408981434
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
# mas 'Pages', id: 409201541
