tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# dependencies
brew 'pkg-config' # bunch of things

# foundation
brew 'awscli'
brew 'bat'
brew 'c-ares'
brew 'composer'
brew 'coreutils'
brew 'dnsmasq'
brew 'fd'
brew 'findutils'
brew 'fzf'
brew 'git-delta'
brew 'git-flow'
brew 'git-open'
brew 'git'
brew 'gnu-sed'
brew 'gnu-which'
brew 'gnupg'
brew 'gti'
brew 'java'
brew 'less'
brew 'mas'
brew 'mackup'
brew 'nginx'
brew 'node'
brew 'php@8.0'
brew 'ripgrep'
brew 'sqlite'
brew 'tree'
brew 'vim'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'z'
brew 'zsh-autosuggestions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'
brew 'zsh'

# apps
cask '1password'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'github'
cask 'imageoptim'
cask 'loom'
cask 'notion'
cask 'messenger'
cask 'mimestream'
cask 'ray'
cask 'raycast'
cask 'spotify'
cask 'slack'
cask 'sublime-text'
cask 'tableplus'
cask 'telegram'
cask 'tinkerwell'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'

# mas "Adblock Plus", id: 1432731683
# mas "GarageBand", id: 682658836
# mas "iMovie", id: 408981434
# mas "Keynote", id: 409183694
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
