tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/services'

# dependencies
brew 'pkg-config' # bunch of things

# foundation
brew 'awscli'
brew 'bat'
brew 'composer'
brew 'coreutils'
brew 'fd'
brew 'findutils'
brew 'fzf'
brew 'git'
brew 'git-delta'
brew 'git-flow'
brew 'git-open'
brew 'gnu-sed'
brew 'gnu-which'
brew 'gnupg'
brew 'gti'
brew 'java'
brew 'less'
brew 'mas'
brew 'node'
brew 'php@8.0'
brew 'ripgrep'
brew 'sqlite'
brew 'tree'
brew 'vim'
brew 'watchman'
brew 'wget'
brew 'wrk'
brew 'yarn'
brew 'z'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'
# apps
cask '1password'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'github'
cask 'imageoptim'
cask 'loom'
cask 'notion'
cask 'messenger'
cask 'ray'
cask 'raycast'
cask 'spotify'
cask 'slack'
cask 'sublime-text'
cask 'tableplus'
cask 'telegram'
cask 'tinkerwell'
cask 'visual-studio-code'
casl 'vlc'
cask 'zoom'

# MAS apps
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
